Config/Documents/ПереносОстатков64нНФА.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПереносОстатков64нНФА</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.СтоимостьОбъектовОС</xr:Item>
				<xr:Item>InformationRegister.УчетныеДанныеОбъектаОС</xr:Item>
				<xr:Item>InformationRegister.СобытияОС</xr:Item>
				<xr:Item>AccumulationRegister.АмортизацияОбъектовОС</xr:Item>
				<xr:Item>AccountingRegister.ЖурналПроводокЕПСБУ</xr:Item>
				<xr:Item>AccumulationRegister.СтоимостьОбъектовОСПоКонтрагентам</xr:Item>
				<xr:Item>AccumulationRegister.ОборотыРасчетовСУчредителями</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОперацииПереносОстатков64нНФА</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборИФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборКФО</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КВД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборСчет</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.ЕПСБУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидМежотчетногоПериода</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыМежотчетногоПериода</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Переводы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Объект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
								<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетСтарый</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.ЕПСБУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетНовый</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.ЕПСБУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/AccumulationRegisters/СтоимостьОбъектовОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>СтоимостьОбъектовОС</Name>
			<Comment>Стоимость и количество объектов на счетах 101, 102, 103, 108, 111.60, 21</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНеУчитываетсяНУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаЕНВД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСобытийОС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазваниеДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Причина</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПричинаСписания</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРаботы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорИсполнителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеГТ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерГТ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаГТ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДействияГТ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидРаспоряжения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыРаспоряженияОС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИнвентарныйНомер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнвентарныеНомераОС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦМО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦМО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Config/AccumulationRegisters/АмортизацияОбъектовОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>АмортизацияОбъектовОС</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаАмортизации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОбесценения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоСписание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИнвентарныйНомер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнвентарныеНомераОС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Config/InformationRegisters/ДатыПереходаНаПрименениеРедакцийПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДатыПереходаНаПрименениеРедакцийПС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаНачалаПрименения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>АвторИзменения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РедакцияПС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РедакцииПланаСчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/InformationRegisters/СоответствиеСчетовОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СоответствиеСчетовОС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СчетАмортизации</Name>
					<Type>
						<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетОбесценения</Name>
					<Type>
						<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗабалансовыйСчет</Name>
					<Type>
						<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетПередачиВАренду</Name>
					<Type>
						<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетПередачиВПользование</Name>
					<Type>
						<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетПередачиВУправление</Name>
					<Type>
						<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СчетОС</Name>
					<Type>
						<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/Enums/РедакцииПланаСчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>РедакцииПланаСчетов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Приказ64н2018</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Приказ298н2019</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Documents/ПереносОстатков64нНФА/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	СформированныеДокументыБИА = Новый Массив;
	
	ОбменСАрхивомБГУ.СоздатьДокументыБИАДляДокументаУчета(СсылкаНаОбъектИсточник, СформированныеДокументыБИА);
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПроведениеДокумента

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт

	РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСсылка, "Организация,Дата,Номер,ВидОперации,Контрагент");
	
	Если РеквизитыДокумента.ВидОперации <> Перечисления.ОперацииПереносОстатков64нНФА.НеАктивы Тогда
		Возврат;
	КонецЕсли;
	
	ДатаПерехода = БухгалтерскийУчет.ДатаПереходаНаРедакциюПС(РеквизитыДокумента.Организация, РеквизитыДокумента.Дата);
	Если Не ЗначениеЗаполнено(ДатаПерехода) Тогда
		Возврат;
	КонецЕсли;
	
	Период = НачалоГода(ДатаПерехода) - 1;
	ПериодНачало = НачалоГода(ДатаПерехода);	
	Если НачалоДня(ДатаПерехода) = НачалоГода(ДатаПерехода) Тогда
		ПериодКонец = ПериодНачало;
	Иначе
		ПериодКонец = НачалоДня(ДатаПерехода) - 1;	
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка"				, ДокументСсылка);
	Запрос.УстановитьПараметр("Организация"			, РеквизитыДокумента.Организация);
	Запрос.УстановитьПараметр("Контрагент"			, РеквизитыДокумента.Контрагент);
	Запрос.УстановитьПараметр("Период"				, Период);	
	Запрос.УстановитьПараметр("ПериодНачало"		, ПериодНачало);
	Запрос.УстановитьПараметр("ПериодКонец"			, ПериодКонец);
	Запрос.УстановитьПараметр("ПереносОборотов"		, ПериодКонец > ПериодНачало);
	Запрос.УстановитьПараметр("НазваниеДокумента"	, "Cправка ф.0504833");
	Запрос.УстановитьПараметр("НомерДокумента"		, РеквизитыДокумента.Номер);
	Запрос.УстановитьПараметр("ДатаДокумента"		, РеквизитыДокумента.Дата);	
	
	ТаблицыЗапроса = Новый Массив;
	ТаблицыЗапроса.Добавить("СписокОС");
	ТаблицыЗапроса.Добавить("ОстаткиОС");
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МИНИМУМ(Переводы.НомерСтроки) КАК НомерСтроки,
	|	Переводы.Объект КАК Объект
	|ПОМЕСТИТЬ СписокОС
	|ИЗ
	|	Документ.ПереносОстатков64нНФА.Переводы КАК Переводы
	|ГДЕ
	|	Переводы.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	Переводы.Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтоимостьОстатки.Организация КАК Организация,
	|	СтоимостьОстатки.ОсновноеСредство КАК ОсновноеСредство,
	|	СтоимостьОстатки.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	СтоимостьОстатки.ЦМО КАК ЦМО,
	|	СтоимостьОстатки.ВидРаспоряжения КАК ВидРаспоряжения,
	|	СтоимостьОстатки.Подразделение КАК Подразделение,
	|	СтоимостьОстатки.СтоимостьОстаток КАК СтоимостьОстаток,
	|	СтоимостьОстатки.КоличествоОстаток КАК КоличествоОстаток,
	|	СтоимостьОстатки.СуммаНеУчитываетсяНУОстаток КАК СуммаНеУчитываетсяНУОстаток,
	|	СтоимостьОстатки.СуммаЕНВДОстаток КАК СуммаЕНВДОстаток,
	|	СтоимостьОстатки.СуммаНДСОстаток КАК СуммаНДСОстаток
	|ПОМЕСТИТЬ ОстаткиОС
	|ИЗ
	|	РегистрНакопления.СтоимостьОбъектовОС.Остатки(
	|			&ПериодНачало,
	|			Организация = &Организация
	|				И ОсновноеСредство В
	|					(ВЫБРАТЬ
	|						ВТ.Объект
	|					ИЗ
	|						СписокОС КАК ВТ)) КАК СтоимостьОстатки";	
	
	ТаблицыЗапроса.Добавить("СтоимостьОбъектовОС");
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +	
	"ВЫБРАТЬ
	|	&Период КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	СтоимостьОстатки.Организация КАК Организация,
	|	СтоимостьОстатки.ОсновноеСредство КАК ОсновноеСредство,
	|	СтоимостьОстатки.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	СтоимостьОстатки.ЦМО КАК ЦМО,
	|	СтоимостьОстатки.ВидРаспоряжения КАК ВидРаспоряжения,
	|	СтоимостьОстатки.Подразделение КАК Подразделение,
	|	СтоимостьОстатки.СтоимостьОстаток КАК Стоимость,
	|	СтоимостьОстатки.КоличествоОстаток КАК Количество,
	|	СтоимостьОстатки.СуммаНеУчитываетсяНУОстаток КАК СуммаНеУчитываетсяНУ,
	|	СтоимостьОстатки.СуммаЕНВДОстаток КАК СуммаЕНВД,
	|	СтоимостьОстатки.СуммаНДСОстаток КАК СуммаНДС,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.Списание) КАК Событие,
	|	&НазваниеДокумента КАК НазваниеДокумента,
	|	&НомерДокумента КАК НомерДокумента,
	|	&ДатаДокумента КАК ДатаДокумента,
	|	ЕСТЬNULL(СписокОС.НомерСтроки, 0) КАК НомерСтрокиПорядок
	|ИЗ
	|	ОстаткиОС КАК СтоимостьОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ СписокОС КАК СписокОС
	|		ПО СтоимостьОстатки.ОсновноеСредство = СписокОС.Объект
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СтоимостьОбороты.Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	СтоимостьОбороты.Организация,
	|	СтоимостьОбороты.ОсновноеСредство,
	|	СтоимостьОбороты.ИнвентарныйНомер,
	|	СтоимостьОбороты.ЦМО,
	|	СтоимостьОбороты.ВидРаспоряжения,
	|	СтоимостьОбороты.Подразделение,
	|	-СтоимостьОбороты.СтоимостьОборот,
	|	-СтоимостьОбороты.КоличествоОборот,
	|	-СтоимостьОбороты.СуммаНеУчитываетсяНУОборот,
	|	-СтоимостьОбороты.СуммаЕНВДОборот,
	|	-СтоимостьОбороты.СуммаНДСОборот,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ПустаяСсылка),
	|	&НазваниеДокумента,
	|	&НомерДокумента,
	|	&ДатаДокумента,
	|	ЕСТЬNULL(СписокОС.НомерСтроки, 0)
	|ИЗ
	|	РегистрНакопления.СтоимостьОбъектовОС.Обороты(
	|			&ПериодНачало,
	|			&ПериодКонец,
	|			Запись,
	|			Организация = &Организация
	|				И &ПереносОборотов
	|				И ОсновноеСредство В
	|					(ВЫБРАТЬ
	|						ВТ.Объект
	|					ИЗ
	|						СписокОС КАК ВТ)) КАК СтоимостьОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ СписокОС КАК СписокОС
	|		ПО СтоимостьОбороты.ОсновноеСредство = СписокОС.Объект
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтрокиПорядок,
	|	Период";
	
	ТаблицыЗапроса.Добавить("АмортизацияОбъектовОС");
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +	
	"ВЫБРАТЬ
	|	&Период КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	АмортизацияОстатки.Организация КАК Организация,
	|	АмортизацияОстатки.ОсновноеСредство КАК ОсновноеСредство,
	|	АмортизацияОстатки.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	АмортизацияОстатки.СуммаАмортизацииОстаток КАК СуммаАмортизации,
	|	ИСТИНА КАК ЭтоСписание,
	|	ЕСТЬNULL(СписокОС.НомерСтроки, 0) КАК НомерСтрокиПорядок
	|ИЗ
	|	РегистрНакопления.АмортизацияОбъектовОС.Остатки(
	|			&ПериодНачало,
	|			Организация = &Организация
	|				И ОсновноеСредство В
	|					(ВЫБРАТЬ
	|						ВТ.Объект
	|					ИЗ
	|						СписокОС КАК ВТ)) КАК АмортизацияОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ СписокОС КАК СписокОС
	|		ПО АмортизацияОстатки.ОсновноеСредство = СписокОС.Объект
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	АмортизацияОбороты.Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	АмортизацияОбороты.Организация,
	|	АмортизацияОбороты.ОсновноеСредство,
	|	АмортизацияОбороты.ИнвентарныйНомер,
	|	-АмортизацияОбороты.СуммаАмортизацииОборот,
	|	ЛОЖЬ,
	|	ЕСТЬNULL(СписокОС.НомерСтроки, 0)
	|ИЗ
	|	РегистрНакопления.АмортизацияОбъектовОС.Обороты(
	|			&ПериодНачало,
	|			&ПериодКонец,
	|			Запись,
	|			Организация = &Организация
	|				И &ПереносОборотов
	|				И ОсновноеСредство В
	|					(ВЫБРАТЬ
	|						ВТ.Объект
	|					ИЗ
	|						СписокОС КАК ВТ)) КАК АмортизацияОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ СписокОС КАК СписокОС
	|		ПО АмортизацияОбороты.ОсновноеСредство = СписокОС.Объект
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтрокиПорядок,
	|	Период";

	ТаблицыЗапроса.Добавить("СобытияОС");
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
	"ВЫБРАТЬ
	|	&Период КАК Период,
	|	ОстаткиОС.Организация КАК Организация,
	|	ОстаткиОС.ОсновноеСредство КАК ОсновноеСредство,
	|	ОстаткиОС.ИнвентарныйНомер КАК ИнвНомер,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.Списание) КАК Событие,
	|	&Период КАК ДатаСобытия,
	|	""Не соответствует критериям актива"" КАК ПричинаСписания,
	|	&НазваниеДокумента КАК НазваниеДокумента,
	|	&НомерДокумента КАК НомерДокумента,
	|	&ДатаДокумента КАК ДатаДокумента
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ВТ.Организация КАК Организация,
	|		ВТ.ОсновноеСредство КАК ОсновноеСредство,
	|		ВТ.ИнвентарныйНомер КАК ИнвентарныйНомер
	|	ИЗ
	|		ОстаткиОС КАК ВТ) КАК ОстаткиОС";
	
	ТаблицыЗапроса.Добавить("СтоимостьОбъектовОСПоКонтрагентам");
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
	"ВЫБРАТЬ
	|	&Период КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ОстаткиОС.Организация КАК Организация,
	|	ОстаткиОС.ЦМО КАК ЦМО,
	|	&Контрагент КАК Контрагент,
	|	ОстаткиОС.ОсновноеСредство КАК ОсновноеСредство,
	|	ОстаткиОС.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.НаХранении) КАК ВидРаспоряжения,
	|	ОстаткиОС.Подразделение КАК Подразделение,
	|	ОстаткиОС.КоличествоОстаток КАК Стоимость,
	|	ОстаткиОС.КоличествоОстаток КАК Количество
	|ИЗ
	|	ОстаткиОС КАК ОстаткиОС";
	
	Результат = Запрос.ВыполнитьПакет();
	
	ОбщегоНазначенияБГУ.ВыгрузитьТаблицыЗапроса(СтруктураДополнительныеСвойства.ТаблицыДляДвижений, Результат, ТаблицыЗапроса);
	
КонецПроцедуры

Процедура СкорректироватьУчетныеДанные(ВнеоборотныеАктивы) Экспорт
	
	Записи = ВнеоборотныеАктивы.Скопировать(, "Период,ОсновноеСредство");
	Записи.Колонки.Добавить("КоличествоРазличныхСчетовУчета");
	Записи.ЗаполнитьЗначения(1, "КоличествоРазличныхСчетовУчета");
	Записи.Свернуть("Период,ОсновноеСредство", "КоличествоРазличныхСчетовУчета");
	
	Для Каждого Запись Из Записи Цикл		
		Если Запись.КоличествоРазличныхСчетовУчета > 1 Тогда			
			СтрокиЗаписи = ВнеоборотныеАктивы.НайтиСтроки(Новый Структура("Период,ОсновноеСредство", Запись.Период, Запись.ОсновноеСредство));
			Для Сч = 1 По Запись.КоличествоРазличныхСчетовУчета - 1 Цикл
				СтрокиЗаписи[Сч-1].Период = Запись.Период - Запись.КоличествоРазличныхСчетовУчета + Сч;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ПечатьДокумента

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Стандартная бухгалтерская справка
	
КонецПроцедуры

Процедура ДополнитьЗапросБухСправки(ИмяМакета, Запрос, ВключатьЗабалансовые, Расширенная = Ложь) Экспорт
	
	ЭтоОстатки = СтрЗаканчиваетсяНа(ИмяМакета, "_Остатки");
	ЭтоОбороты = СтрЗаканчиваетсяНа(ИмяМакета, "_Обороты");
	
	Если Не ЭтоОстатки И Не ЭтоОбороты Тогда
		Возврат;
	КонецЕсли;
	
	ВключатьЗабалансовые = Истина;
	
	ИмяМакета = Сред(ИмяМакета, 1, СтрДлина(ИмяМакета) - 8);
	
	Запрос.УстановитьПараметр("РедакцияПС", Перечисления.РедакцииПланаСчетов.Приказ64н2018);
		
	ИмяТаблицы = "ЖурналПроводокЕПСБУ" + ?(Расширенная, "ДвиженияССубконто", "");
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "КАК " + ИмяТаблицы, "КАК " + ИмяТаблицы + "
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДатыПереходаНаПрименениеРедакцийПС КАК ДатыПереходаНаПрименениеРедакцийПС
	|		ПО " + ИмяТаблицы + ".Организация = ДатыПереходаНаПрименениеРедакцийПС.Организация
	|		И ДатыПереходаНаПрименениеРедакцийПС.РедакцияПС = &РедакцияПС");	
	Если ЭтоОстатки Тогда
		УсловиеПоля = 
		"ВЫБОР
		|   КОГДА ДатыПереходаНаПрименениеРедакцийПС.ДатаНачалаПрименения ЕСТЬ NULL
		|		ТОГДА ДАТАВРЕМЯ(1,1,1)
		|	ИНАЧЕ ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ДатыПереходаНаПрименениеРедакцийПС.ДатаНачалаПрименения, ГОД), СЕКУНДА, -1)
		|КОНЕЦ";
		ТекстОснования = НСтр("ru = '""Перенос остатков по приказу 64н""'");
	Иначе
		УсловиеПоля =
		"ВЫБОР
		|   КОГДА ДатыПереходаНаПрименениеРедакцийПС.ДатаНачалаПрименения ЕСТЬ NULL
		|		ТОГДА ДАТАВРЕМЯ(1,1,1)
		|	КОГДА НАЧАЛОПЕРИОДА(ДатыПереходаНаПрименениеРедакцийПС.ДатаНачалаПрименения, ДЕНЬ) = НАЧАЛОПЕРИОДА(ДатыПереходаНаПрименениеРедакцийПС.ДатаНачалаПрименения, ГОД)
		|		ТОГДА ДАТАВРЕМЯ(1,1,1)
		|	ИНАЧЕ ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ДатыПереходаНаПрименениеРедакцийПС.ДатаНачалаПрименения, ДЕНЬ), СЕКУНДА, -1)
		|КОНЕЦ";
		ТекстОснования = НСтр("ru = '""Перенос оборотов по приказу 64н""'");
	КонецЕсли;
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПОМЕСТИТЬ ВсеПроводки", ",
	|" + УсловиеПоля + " КАК ДатаДвижения 
	|ПОМЕСТИТЬ ВсеПроводки");
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Регистратор В(&МассивОбъектов)", "Регистратор В(&МассивОбъектов)
	|	И " + УсловиеПоля + " = " + ИмяТаблицы + ".Период");	
	Если Расширенная Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ОперацииДокументов.Дата", "ВсеПроводки.ДатаДвижения");   
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВсеОбъекты.Основание", ТекстОснования);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВсеПроводки.Операция", "ВсеОбъекты.Ссылка.ВидОперации");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ОперацииДокументов.Дата", "ВсеПроводки.ДатаДвижения");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

Функция ПустаяТаблицаОстатки() Экспорт
	
	ТипЧисло_18_2	= Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(18, 2, ДопустимыйЗнак.Любой));
	ТипЧисло_15_3	= Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3, ДопустимыйЗнак.Любой));
	ТипЧисло_15_2	= Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой));
	ТипСчет			= Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ");
	ТипСубконто		= Метаданные.ПланыВидовХарактеристик.ВидыСубконто.Тип;
	
	ПустаяТаблица = Новый ТаблицаЗначений;
	
	ПустаяТаблица.Колонки.Добавить("Период"					, Новый ОписаниеТипов("Дата"));
	ПустаяТаблица.Колонки.Добавить("Счет"					, ТипСчет);
	ПустаяТаблица.Колонки.Добавить("СчетНовый"				, ТипСчет);
	ПустаяТаблица.Колонки.Добавить("Субконто1"				, ТипСубконто);
	ПустаяТаблица.Колонки.Добавить("Субконто2"				, ТипСубконто);
	ПустаяТаблица.Колонки.Добавить("Субконто3"				, ТипСубконто);
	ПустаяТаблица.Колонки.Добавить("КПС"					, Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
	ПустаяТаблица.Колонки.Добавить("КЭК"					, Новый ОписаниеТипов("СправочникСсылка.КОСГУ"));
	ПустаяТаблица.Колонки.Добавить("ИФО"					, Новый ОписаниеТипов("СправочникСсылка.ИсточникиФинансовогоОбеспечения"));
	ПустаяТаблица.Колонки.Добавить("Валюта"					, Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	ПустаяТаблица.Колонки.Добавить("Подразделение"			, Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
	ПустаяТаблица.Колонки.Добавить("СчетАктивный"			, Новый ОписаниеТипов("Булево"));
	ПустаяТаблица.Колонки.Добавить("СчетЗабалансовый"		, Новый ОписаниеТипов("Булево"));
	ПустаяТаблица.Колонки.Добавить("КФО"					, Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
	ПустаяТаблица.Колонки.Добавить("Сумма"					, ТипЧисло_18_2);
	ПустаяТаблица.Колонки.Добавить("ВалютнаяСумма"			, ТипЧисло_18_2);
	ПустаяТаблица.Колонки.Добавить("Количество"				, ТипЧисло_15_3);
	ПустаяТаблица.Колонки.Добавить("СуммаНеУчитываетсяНУ"	, ТипЧисло_15_2);
	ПустаяТаблица.Колонки.Добавить("СуммаЕНВД"				, ТипЧисло_15_2);
	ПустаяТаблица.Колонки.Добавить("СуммаНДС"				, ТипЧисло_15_2);
	
	Возврат ПустаяТаблица;
	
КонецФункции

Функция ТаблицаОстатки(РеквизитыДокумента) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", РеквизитыДокумента.Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПереносОстатков.Объект КАК Объект,
	|	ПереносОстатков.СчетСтарый КАК Счет
	|ПОМЕСТИТЬ ВТ_Данные
	|ИЗ
	|	Документ.ПереносОстатков64нНФА.Переводы КАК ПереносОстатков
	|ГДЕ
	|	ПереносОстатков.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПереносОстатков.Объект,
	|	СоответствиеСчетовОС.СчетАмортизации
	|ИЗ
	|	Документ.ПереносОстатков64нНФА.Переводы КАК ПереносОстатков
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеСчетовОС КАК СоответствиеСчетовОС
	|		ПО ПереносОстатков.СчетСтарый = СоответствиеСчетовОС.СчетОС
	|ГДЕ
	|	ПереносОстатков.Ссылка = &Ссылка
	|	И СоответствиеСчетовОС.СчетАмортизации <> ЗНАЧЕНИЕ(ПланСчетов.ЕПСБУ.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Данные.Объект КАК Объект
	|ИЗ
	|	ВТ_Данные КАК ВТ_Данные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Данные.Счет КАК Счет
	|ИЗ
	|	ВТ_Данные КАК ВТ_Данные";

	Результат		= Запрос.ВыполнитьПакет();
	СписокОбъектов	= Результат[1].Выгрузить().ВыгрузитьКолонку("Объект");
	СписокСчетов	= Результат[2].Выгрузить().ВыгрузитьКолонку("Счет");	

	ДатаПерехода = БухгалтерскийУчет.ДатаПереходаНаРедакциюПС(РеквизитыДокумента.Организация, РеквизитыДокумента.Дата);
	Если ЗначениеЗаполнено(ДатаПерехода) Тогда
		Период = НачалоГода(ДатаПерехода) - 1;
		ДатаОстатков = НачалоГода(ДатаПерехода);
	Иначе
		Период = '00010101';
		ДатаОстатков = '00010101';	
	КонецЕсли;

	Запрос.УстановитьПараметр("Период"			, Период);
	Запрос.УстановитьПараметр("ДатаОстатков"	, ДатаОстатков);
	Запрос.УстановитьПараметр("ПолучитьОстатки"	, ЗначениеЗаполнено(ДатаОстатков));
	Запрос.УстановитьПараметр("Организация"		, РеквизитыДокумента.Организация);
	Запрос.УстановитьПараметр("СпОбъектов"		, СписокОбъектов);
	Запрос.УстановитьПараметр("Счет"			, СписокСчетов);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПереносОстатков.НомерСтроки КАК НомерСтроки,
	|	ПереносОстатков.Объект КАК Объект,
	|	ПереносОстатков.СчетСтарый КАК СчетСтарый,
	|	ПереносОстатков.СчетНовый КАК СчетНовый,
	|	1 КАК ДопПорядок
	|ПОМЕСТИТЬ Переводы
	|ИЗ
	|	Документ.ПереносОстатков64нНФА.Переводы КАК ПереносОстатков
	|ГДЕ
	|	ПереносОстатков.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПереносОстатков.НомерСтроки,
	|	ПереносОстатков.Объект,
	|	СоответствиеСчетовОССтарый.СчетАмортизации,
	|	СоответствиеСчетовОСНовый.СчетАмортизации,
	|	2
	|ИЗ
	|	Документ.ПереносОстатков64нНФА.Переводы КАК ПереносОстатков
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеСчетовОС КАК СоответствиеСчетовОССтарый
	|		ПО ПереносОстатков.СчетСтарый = СоответствиеСчетовОССтарый.СчетОС
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеСчетовОС КАК СоответствиеСчетовОСНовый
	|		ПО ПереносОстатков.СчетНовый = СоответствиеСчетовОСНовый.СчетОС
	|ГДЕ
	|	ПереносОстатков.Ссылка = &Ссылка
	|	И СоответствиеСчетовОССтарый.СчетАмортизации <> ЗНАЧЕНИЕ(ПланСчетов.ЕПСБУ.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Остатки.Счет КАК Счет,
	|	Остатки.Субконто1 КАК Субконто1,
	|	Остатки.Субконто2 КАК Субконто2,
	|	Остатки.Субконто3 КАК Субконто3,
	|	Остатки.КПС КАК КПС,
	|	Остатки.КЭК КАК КЭК,
	|	Остатки.ИФО КАК ИФО,
	|	Остатки.Валюта КАК Валюта,
	|	Остатки.Подразделение КАК Подразделение,
	|	Остатки.КФО КАК КФО,
	|	Остатки.Счет.Забалансовый КАК СчетЗабалансовый,
	|	ВЫБОР
	|		КОГДА Остатки.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Пассивный)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК СчетАктивный,
	|	ВЫБОР
	|		КОГДА Остатки.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Пассивный)
	|			ТОГДА -Остатки.СуммаОстаток
	|		ИНАЧЕ Остатки.СуммаОстаток
	|	КОНЕЦ КАК Сумма,
	|	ВЫБОР
	|		КОГДА Остатки.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Пассивный)
	|			ТОГДА -Остатки.ВалютнаяСуммаОстаток
	|		ИНАЧЕ Остатки.ВалютнаяСуммаОстаток
	|	КОНЕЦ КАК ВалютнаяСумма,
	|	ВЫБОР
	|		КОГДА Остатки.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Пассивный)
	|			ТОГДА -Остатки.КоличествоОстаток
	|		ИНАЧЕ Остатки.КоличествоОстаток
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА Остатки.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Пассивный)
	|			ТОГДА -Остатки.СуммаНеУчитываетсяНУОстаток
	|		ИНАЧЕ Остатки.СуммаНеУчитываетсяНУОстаток
	|	КОНЕЦ КАК СуммаНеУчитываетсяНУ,
	|	ВЫБОР
	|		КОГДА Остатки.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Пассивный)
	|			ТОГДА -Остатки.СуммаЕНВДОстаток
	|		ИНАЧЕ Остатки.СуммаЕНВДОстаток
	|	КОНЕЦ КАК СуммаЕНВД,
	|	ВЫБОР
	|		КОГДА Остатки.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Пассивный)
	|			ТОГДА -Остатки.СуммаНДСОстаток
	|		ИНАЧЕ Остатки.СуммаНДСОстаток
	|	КОНЕЦ КАК СуммаНДС
	|ПОМЕСТИТЬ Остатки
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(
	|			&ДатаОстатков,
	|			Счет В (&Счет),
	|			,
	|			&ПолучитьОстатки
	|				И Организация = &Организация
	|				И (Субконто1 В (&СпОбъектов)
	|					ИЛИ Субконто2 В (&СпОбъектов))) КАК Остатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Период КАК Период,
	|	Остатки.Счет КАК Счет,
	|	Остатки.Субконто1 КАК Субконто1,
	|	Остатки.Субконто2 КАК Субконто2,
	|	Остатки.Субконто3 КАК Субконто3,
	|	Остатки.КПС КАК КПС,
	|	Остатки.КЭК КАК КЭК,
	|	Остатки.ИФО КАК ИФО,
	|	Остатки.Валюта КАК Валюта,
	|	Остатки.Подразделение КАК Подразделение,
	|	Остатки.СчетАктивный КАК СчетАктивный,
	|	Остатки.СчетЗабалансовый КАК СчетЗабалансовый,
	|	Остатки.КФО КАК КФО,
	|	Остатки.Сумма КАК Сумма,
	|	Остатки.ВалютнаяСумма КАК ВалютнаяСумма,
	|	Остатки.Количество КАК Количество,
	|	Остатки.СуммаНеУчитываетсяНУ КАК СуммаНеУчитываетсяНУ,
	|	Остатки.СуммаЕНВД КАК СуммаЕНВД,
	|	Остатки.СуммаНДС КАК СуммаНДС,
	|	Переводы.СчетНовый КАК СчетНовый
	|ИЗ
	|	Переводы КАК Переводы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Остатки КАК Остатки
	|		ПО Переводы.СчетСтарый = Остатки.Счет
	|			И (Переводы.Объект = Остатки.Субконто1
	|				ИЛИ Переводы.Объект = Остатки.Субконто2)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Переводы.НомерСтроки,
	|	Переводы.ДопПорядок";
	
	Если РеквизитыДокумента.ВидОперации = Перечисления.ОперацииПереносОстатков64нНФА.ИмуществоВКонцессииИК Тогда
		СкорректироватьСчетАмортизацииИК(Запрос);
	КонецЕсли;
	
	ТаблицаРезультат = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаРезультат;
	
КонецФункции

Функция ПустаяТаблицаОбороты() Экспорт
	
	Возврат ТаблицаОбороты(Неопределено);
	
КонецФункции

Функция ТаблицаОбороты(РеквизитыДокумента) Экспорт
		
	Запрос = Новый Запрос;
	
	Если РеквизитыДокумента = Неопределено Тогда
		
		пПереносы = Новый ТаблицаЗначений;
		пПереносы.Колонки.Добавить("Объект");
		РеквизитыДокумента = Новый Структура("Ссылка,Дата,Организация,ВидОперации,Переносы",
			Документы.ПереносОстатков64нНФА.ПустаяСсылка(), '00010101', Справочники.Организации.ПустаяСсылка(),
			Перечисления.ОперацииПереносОстатков64нНФА.ПустаяСсылка(), пПереносы);
			
		Запрос.УстановитьПараметр("Ссылка", РеквизитыДокумента.Ссылка);	
		СписокСчетов = Новый Массив;
		
	Иначе
		
		Запрос.УстановитьПараметр("Ссылка", РеквизитыДокумента.Ссылка);
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПереносОстатков.СчетСтарый КАК Счет
		|ИЗ
		|	Документ.ПереносОстатков64нНФА.Переводы КАК ПереносОстатков
		|ГДЕ
		|	ПереносОстатков.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СоответствиеСчетовОС.СчетАмортизации
		|ИЗ
		|	Документ.ПереносОстатков64нНФА.Переводы КАК ПереносОстатков
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеСчетовОС КАК СоответствиеСчетовОС
		|		ПО ПереносОстатков.СчетСтарый = СоответствиеСчетовОС.СчетОС
		|ГДЕ
		|	ПереносОстатков.Ссылка = &Ссылка
		|	И СоответствиеСчетовОС.СчетАмортизации <> ЗНАЧЕНИЕ(ПланСчетов.ЕПСБУ.ПустаяСсылка)";
	
		СписокСчетов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Счет");
		
	КонецЕсли;
	
	ДатаПерехода = БухгалтерскийУчет.ДатаПереходаНаРедакциюПС(РеквизитыДокумента.Организация, РеквизитыДокумента.Дата);
	Если ЗначениеЗаполнено(ДатаПерехода) И НачалоДня(ДатаПерехода) <> НачалоГода(ДатаПерехода) Тогда
		ПериодНачало	= НачалоГода(ДатаПерехода);
		ПериодКонец		= НачалоДня(ДатаПерехода) - 1;
		Период			= НачалоДня(ДатаПерехода) - 1;
	Иначе
		ПериодНачало	= '00010101';
		ПериодКонец		= '00010101';
		Период			= '00010101';		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Период"			, Период);
	Запрос.УстановитьПараметр("ПериодНачало"	, ПериодНачало);
	Запрос.УстановитьПараметр("ПериодКонец"		, ПериодКонец);
	Запрос.УстановитьПараметр("ПолучитьОбороты"	, ПериодКонец > ПериодНачало);
	Запрос.УстановитьПараметр("Организация"		, РеквизитыДокумента.Организация);
	Запрос.УстановитьПараметр("Счет"			, СписокСчетов);	
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПереносОстатков.НомерСтроки КАК НомерСтроки,
	|	ПереносОстатков.Объект КАК Объект,
	|	ПереносОстатков.СчетСтарый КАК СчетСтарый,
	|	ПереносОстатков.СчетНовый КАК СчетНовый,
	|	1 КАК ДопПорядок
	|ПОМЕСТИТЬ Переводы
	|ИЗ
	|	Документ.ПереносОстатков64нНФА.Переводы КАК ПереносОстатков
	|ГДЕ
	|	ПереносОстатков.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПереносОстатков.НомерСтроки,
	|	ПереносОстатков.Объект,
	|	СоответствиеСчетовОССтарый.СчетАмортизации,
	|	СоответствиеСчетовОСНовый.СчетАмортизации,
	|	2
	|ИЗ
	|	Документ.ПереносОстатков64нНФА.Переводы КАК ПереносОстатков
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеСчетовОС КАК СоответствиеСчетовОССтарый
	|		ПО ПереносОстатков.СчетСтарый = СоответствиеСчетовОССтарый.СчетОС
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеСчетовОС КАК СоответствиеСчетовОСНовый
	|		ПО ПереносОстатков.СчетНовый = СоответствиеСчетовОСНовый.СчетОС
	|ГДЕ
	|	ПереносОстатков.Ссылка = &Ссылка
	|	И СоответствиеСчетовОССтарый.СчетАмортизации <> ЗНАЧЕНИЕ(ПланСчетов.ЕПСБУ.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Обороты.Регистратор КАК Регистратор,
	|	&Период КАК Период,
	|	Обороты.СчетДт КАК СчетДт,
	|	Обороты.СубконтоДт1 КАК СубконтоДт1,
	|	Обороты.СубконтоДт2 КАК СубконтоДт2,
	|	Обороты.СубконтоДт3 КАК СубконтоДт3,
	|	Обороты.СчетКт КАК СчетКт,
	|	Обороты.СубконтоКт1 КАК СубконтоКт1,
	|	Обороты.СубконтоКт2 КАК СубконтоКт2,
	|	Обороты.СубконтоКт3 КАК СубконтоКт3,
	|	Обороты.КПСДт КАК КПСДт,
	|	Обороты.КПСКт КАК КПСКт,
	|	Обороты.КЭКДт КАК КЭКДт,
	|	Обороты.КЭККт КАК КЭККт,
	|	Обороты.ИФО КАК ИФО,
	|	Обороты.ВалютаДт КАК ВалютаДт,
	|	Обороты.ВалютаКт КАК ВалютаКт,
	|	Обороты.ПодразделениеДт КАК ПодразделениеДт,
	|	Обороты.ПодразделениеКт КАК ПодразделениеКт,
	|	Обороты.ЖурналОпераций КАК ЖурналОпераций,
	|	Обороты.КФО КАК КФО,
	|	ЕСТЬNULL(Обороты.Сумма, 0) КАК Сумма,
	|	ЕСТЬNULL(Обороты.ВалютнаяСуммаДт, 0) КАК ВалютнаяСуммаДт,
	|	ЕСТЬNULL(Обороты.ВалютнаяСуммаКт, 0) КАК ВалютнаяСуммаКт,
	|	ЕСТЬNULL(Обороты.КоличествоДт, 0) КАК КоличествоДт,
	|	ЕСТЬNULL(Обороты.КоличествоКт, 0) КАК КоличествоКт,
	|	ЕСТЬNULL(Обороты.СуммаНеУчитываетсяНУ, 0) КАК СуммаНеУчитываетсяНУ,
	|	ЕСТЬNULL(Обороты.СуммаЕНВД, 0) КАК СуммаЕНВД,
	|	ЕСТЬNULL(Обороты.СуммаНДС, 0) КАК СуммаНДС,
	|	Обороты.Содержание КАК Содержание,
	|	Обороты.ХарактеристикаДвиженияДт КАК ХарактеристикаДвиженияДт,
	|	Обороты.ХарактеристикаДвиженияКт КАК ХарактеристикаДвиженияКт,
	|	Обороты.ВидПервичногоДокумента КАК ВидПервичногоДокумента,
	|	Обороты.ДатаПервичногоДокумента КАК ДатаПервичногоДокумента,
	|	Обороты.НомерПервичногоДокумента КАК НомерПервичногоДокумента,
	|	ПереводыДт.СчетНовый КАК СчетДтНовый,
	|	ПереводыКт.СчетНовый КАК СчетКтНовый,
	|	Обороты.Период КАК ПериодПорядок,
	|	ЕСТЬNULL(ПереводыДт.НомерСтроки, ПереводыКт.НомерСтроки) КАК НомерСтроки,
	|	ЕСТЬNULL(ПереводыДт.ДопПорядок, ПереводыКт.ДопПорядок) КАК ДопПорядок
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.ДвиженияССубконто(
	|			&ПериодНачало,
	|			&ПериодКонец,
	|			&ПолучитьОбороты
	|				И Активность
	|				И Организация = &Организация
	|				И (СчетДт В (&Счет)
	|					ИЛИ СчетКт В (&Счет))
	|				И Регистратор <> &Ссылка,
	|			,
	|			) КАК Обороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Переводы КАК ПереводыДт
	|		ПО Обороты.СчетДт = ПереводыДт.СчетСтарый
	|			И (Обороты.СубконтоДт1 = ПереводыДт.Объект
	|				ИЛИ Обороты.СубконтоДт2 = ПереводыДт.Объект)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Переводы КАК ПереводыКт
	|		ПО Обороты.СчетКт = ПереводыКт.СчетСтарый
	|			И (Обороты.СубконтоКт1 = ПереводыКт.Объект
	|				ИЛИ Обороты.СубконтоКт2 = ПереводыКт.Объект)
	|ГДЕ
	|	(НЕ ПереводыДт.СчетНовый ЕСТЬ NULL
	|			ИЛИ НЕ ПереводыКт.СчетНовый ЕСТЬ NULL)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПериодПорядок,
	|	НомерСтроки,
	|	ДопПорядок";
	
	Если РеквизитыДокумента.ВидОперации = Перечисления.ОперацииПереносОстатков64нНФА.НеАктивы Тогда		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "СчетНовый ЕСТЬ NULL", "СчетСтарый ЕСТЬ NULL");
	ИначеЕсли РеквизитыДокумента.ВидОперации = Перечисления.ОперацииПереносОстатков64нНФА.ИмуществоВКонцессииИК Тогда
		СкорректироватьСчетАмортизацииИК(Запрос);
	КонецЕсли;
	
	ТаблицаРезультат = Запрос.Выполнить().Выгрузить();
	ТаблицаРезультат.Колонки.Удалить("ПериодПорядок");
	ТаблицаРезультат.Колонки.Удалить("НомерСтроки");
	ТаблицаРезультат.Колонки.Удалить("ДопПорядок");
	
	Возврат ТаблицаРезультат;
	
КонецФункции

Процедура СкорректироватьСчетАмортизацииИК(Запрос)
	
	Счет_104_58 = БухгалтерскийУчет.СчетПоКоду("104.58", '00010101');
	Счет_104_59 = БухгалтерскийУчет.СчетПоКоду("104.59", '00010101');		
	Счет_104_52 = БухгалтерскийУчет.СчетПоКоду("104.52", '20180101');
	Счет_104_54 = БухгалтерскийУчет.СчетПоКоду("104.54", '20180101');
	
	ЧастиУсловия = Новый Массив;
	
	Индекс = Запрос.Параметры.Счет.Найти(Счет_104_52);
	Если Индекс <> Неопределено Тогда
		Запрос.Параметры.Счет[Индекс] = Счет_104_58;
		ЧастиУсловия.Добавить("КОГДА СоответствиеСчетовОССтарый.СчетАмортизации = &Счет_104_52 ТОГДА &Счет_104_58");
		Запрос.УстановитьПараметр("Счет_104_52", Счет_104_52);
		Запрос.УстановитьПараметр("Счет_104_58", Счет_104_58);
	КонецЕсли;
	
	Индекс = Запрос.Параметры.Счет.Найти(Счет_104_54);
	Если Индекс <> Неопределено Тогда
		Запрос.Параметры.Счет[Индекс] = Счет_104_59;
		ЧастиУсловия.Добавить("КОГДА СоответствиеСчетовОССтарый.СчетАмортизации = &Счет_104_54 ТОГДА &Счет_104_59");
		Запрос.УстановитьПараметр("Счет_104_54", Счет_104_54);
		Запрос.УстановитьПараметр("Счет_104_59", Счет_104_59);			
	КонецЕсли;
	
	Если ЧастиУсловия.Количество() > 0 Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "СоответствиеСчетовОССтарый.СчетАмортизации,",
		"ВЫБОР
		|	" + СтрСоединить(ЧастиУсловия, Символы.ПС + Символы.Таб) + "
		|	ИНАЧЕ СоответствиеСчетовОССтарый.СчетАмортизации
		|КОНЕЦ,");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
